Revit 2027 API
UpdaterRegistry.IsUpdaterRegistered Method
Overload List
Name | Description
IsUpdaterRegistered(UpdaterId) |  Checks whether updater with the given id is registered
IsUpdaterRegistered(UpdaterId, Document) |  Checks whether updater with the given id is registered in a document.
Top
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace